{"text": "Define dynamic grid balancing within offshore wind integration programs.", "intent": "definition"}
{"text": "Define dynamic grid balancing within municipal microgrids.", "intent": "definition"}
{"text": "Define dynamic grid balancing within regional reliability planning.", "intent": "definition"}
{"text": "Define dynamic grid balancing within utility-scale solar corridors.", "intent": "definition"}
{"text": "Define dynamic grid balancing within industrial demand flexibility portfolios.", "intent": "definition"}
{"text": "Define curtailment forecasting within offshore wind integration programs.", "intent": "definition"}
{"text": "Define curtailment forecasting within municipal microgrids.", "intent": "definition"}
{"text": "Define curtailment forecasting within regional reliability planning.", "intent": "definition"}
{"text": "Define curtailment forecasting within utility-scale solar corridors.", "intent": "definition"}
{"text": "Define curtailment forecasting within industrial demand flexibility portfolios.", "intent": "definition"}
{"text": "Define hybrid inverter orchestration within offshore wind integration programs.", "intent": "definition"}
{"text": "Define hybrid inverter orchestration within municipal microgrids.", "intent": "definition"}
{"text": "Define hybrid inverter orchestration within regional reliability planning.", "intent": "definition"}
{"text": "Define hybrid inverter orchestration within utility-scale solar corridors.", "intent": "definition"}
{"text": "Define hybrid inverter orchestration within industrial demand flexibility portfolios.", "intent": "definition"}
{"text": "Define transactive energy marketplace within offshore wind integration programs.", "intent": "definition"}
{"text": "Define transactive energy marketplace within municipal microgrids.", "intent": "definition"}
{"text": "Define transactive energy marketplace within regional reliability planning.", "intent": "definition"}
{"text": "Define transactive energy marketplace within utility-scale solar corridors.", "intent": "definition"}
{"text": "Define transactive energy marketplace within industrial demand flexibility portfolios.", "intent": "definition"}
{"text": "Define demand response aggregator within offshore wind integration programs.", "intent": "definition"}
{"text": "Define demand response aggregator within municipal microgrids.", "intent": "definition"}
{"text": "Define demand response aggregator within regional reliability planning.", "intent": "definition"}
{"text": "Define demand response aggregator within utility-scale solar corridors.", "intent": "definition"}
{"text": "Define demand response aggregator within industrial demand flexibility portfolios.", "intent": "definition"}
{"text": "Define probabilistic load modeling within offshore wind integration programs.", "intent": "definition"}
{"text": "Define probabilistic load modeling within municipal microgrids.", "intent": "definition"}
{"text": "Define probabilistic load modeling within regional reliability planning.", "intent": "definition"}
{"text": "Define probabilistic load modeling within utility-scale solar corridors.", "intent": "definition"}
{"text": "Define probabilistic load modeling within industrial demand flexibility portfolios.", "intent": "definition"}
{"text": "Define ancillary service bidding within offshore wind integration programs.", "intent": "definition"}
{"text": "Define ancillary service bidding within municipal microgrids.", "intent": "definition"}
{"text": "Define ancillary service bidding within regional reliability planning.", "intent": "definition"}
{"text": "Define ancillary service bidding within utility-scale solar corridors.", "intent": "definition"}
{"text": "Define ancillary service bidding within industrial demand flexibility portfolios.", "intent": "definition"}
{"text": "Define grid-friendly desalination within offshore wind integration programs.", "intent": "definition"}
{"text": "Define grid-friendly desalination within municipal microgrids.", "intent": "definition"}
{"text": "Define grid-friendly desalination within regional reliability planning.", "intent": "definition"}
{"text": "Define grid-friendly desalination within utility-scale solar corridors.", "intent": "definition"}
{"text": "Define grid-friendly desalination within industrial demand flexibility portfolios.", "intent": "definition"}
{"text": "Define virtual power plant scheduling within offshore wind integration programs.", "intent": "definition"}
{"text": "Define virtual power plant scheduling within municipal microgrids.", "intent": "definition"}
{"text": "Define virtual power plant scheduling within regional reliability planning.", "intent": "definition"}
{"text": "Define virtual power plant scheduling within utility-scale solar corridors.", "intent": "definition"}
{"text": "Define virtual power plant scheduling within industrial demand flexibility portfolios.", "intent": "definition"}
{"text": "Define resilience index scoring within offshore wind integration programs.", "intent": "definition"}
{"text": "Define resilience index scoring within municipal microgrids.", "intent": "definition"}
{"text": "Define resilience index scoring within regional reliability planning.", "intent": "definition"}
{"text": "Define resilience index scoring within utility-scale solar corridors.", "intent": "definition"}
{"text": "Define resilience index scoring within industrial demand flexibility portfolios.", "intent": "definition"}
{"text": "Define synthetic inertia provisioning within offshore wind integration programs.", "intent": "definition"}
{"text": "Define synthetic inertia provisioning within municipal microgrids.", "intent": "definition"}
{"text": "Define synthetic inertia provisioning within regional reliability planning.", "intent": "definition"}
{"text": "Define synthetic inertia provisioning within utility-scale solar corridors.", "intent": "definition"}
{"text": "Define synthetic inertia provisioning within industrial demand flexibility portfolios.", "intent": "definition"}
{"text": "Define microgrid islanding protocol within offshore wind integration programs.", "intent": "definition"}
{"text": "Define microgrid islanding protocol within municipal microgrids.", "intent": "definition"}
{"text": "Define microgrid islanding protocol within regional reliability planning.", "intent": "definition"}
{"text": "Define microgrid islanding protocol within utility-scale solar corridors.", "intent": "definition"}
{"text": "Define microgrid islanding protocol within industrial demand flexibility portfolios.", "intent": "definition"}
{"text": "How should I design a curtailment mitigation roadmap for coastal wind zones?", "intent": "how_to"}
{"text": "How should I design a curtailment mitigation roadmap across mixed urban feeders?", "intent": "how_to"}
{"text": "How should I design a curtailment mitigation roadmap serving industrial customers?", "intent": "how_to"}
{"text": "How should I design a curtailment mitigation roadmap for campus-scale operations?", "intent": "how_to"}
{"text": "How should I design a curtailment mitigation roadmap for cold-climate solar arrays?", "intent": "how_to"}
{"text": "How should I calibrate distributed energy resource telemetry for coastal wind zones?", "intent": "how_to"}
{"text": "How should I calibrate distributed energy resource telemetry across mixed urban feeders?", "intent": "how_to"}
{"text": "How should I calibrate distributed energy resource telemetry serving industrial customers?", "intent": "how_to"}
{"text": "How should I calibrate distributed energy resource telemetry for campus-scale operations?", "intent": "how_to"}
{"text": "How should I calibrate distributed energy resource telemetry for cold-climate solar arrays?", "intent": "how_to"}
{"text": "How should I deploy virtual power plant controls for coastal wind zones?", "intent": "how_to"}
{"text": "How should I deploy virtual power plant controls across mixed urban feeders?", "intent": "how_to"}
{"text": "How should I deploy virtual power plant controls serving industrial customers?", "intent": "how_to"}
{"text": "How should I deploy virtual power plant controls for campus-scale operations?", "intent": "how_to"}
{"text": "How should I deploy virtual power plant controls for cold-climate solar arrays?", "intent": "how_to"}
{"text": "How should I stage battery energy storage upgrades for coastal wind zones?", "intent": "how_to"}
{"text": "How should I stage battery energy storage upgrades across mixed urban feeders?", "intent": "how_to"}
{"text": "How should I stage battery energy storage upgrades serving industrial customers?", "intent": "how_to"}
{"text": "How should I stage battery energy storage upgrades for campus-scale operations?", "intent": "how_to"}
{"text": "How should I stage battery energy storage upgrades for cold-climate solar arrays?", "intent": "how_to"}
{"text": "How should I commission a hydrogen-ready microgrid for coastal wind zones?", "intent": "how_to"}
{"text": "How should I commission a hydrogen-ready microgrid across mixed urban feeders?", "intent": "how_to"}
{"text": "How should I commission a hydrogen-ready microgrid serving industrial customers?", "intent": "how_to"}
{"text": "How should I commission a hydrogen-ready microgrid for campus-scale operations?", "intent": "how_to"}
{"text": "How should I commission a hydrogen-ready microgrid for cold-climate solar arrays?", "intent": "how_to"}
{"text": "How should I roll out demand response automation for coastal wind zones?", "intent": "how_to"}
{"text": "How should I roll out demand response automation across mixed urban feeders?", "intent": "how_to"}
{"text": "How should I roll out demand response automation serving industrial customers?", "intent": "how_to"}
{"text": "How should I roll out demand response automation for campus-scale operations?", "intent": "how_to"}
{"text": "How should I roll out demand response automation for cold-climate solar arrays?", "intent": "how_to"}
{"text": "How should I audit inverter interoperability for coastal wind zones?", "intent": "how_to"}
{"text": "How should I audit inverter interoperability across mixed urban feeders?", "intent": "how_to"}
{"text": "How should I audit inverter interoperability serving industrial customers?", "intent": "how_to"}
{"text": "How should I audit inverter interoperability for campus-scale operations?", "intent": "how_to"}
{"text": "How should I audit inverter interoperability for cold-climate solar arrays?", "intent": "how_to"}
{"text": "How should I plan seasonal flexibility resources for coastal wind zones?", "intent": "how_to"}
{"text": "How should I plan seasonal flexibility resources across mixed urban feeders?", "intent": "how_to"}
{"text": "How should I plan seasonal flexibility resources serving industrial customers?", "intent": "how_to"}
{"text": "How should I plan seasonal flexibility resources for campus-scale operations?", "intent": "how_to"}
{"text": "How should I plan seasonal flexibility resources for cold-climate solar arrays?", "intent": "how_to"}
{"text": "How should I orchestrate synthetic inertia reserves for coastal wind zones?", "intent": "how_to"}
{"text": "How should I orchestrate synthetic inertia reserves across mixed urban feeders?", "intent": "how_to"}
{"text": "How should I orchestrate synthetic inertia reserves serving industrial customers?", "intent": "how_to"}
{"text": "How should I orchestrate synthetic inertia reserves for campus-scale operations?", "intent": "how_to"}
{"text": "How should I orchestrate synthetic inertia reserves for cold-climate solar arrays?", "intent": "how_to"}
{"text": "How should I launch resilience analytics dashboards for coastal wind zones?", "intent": "how_to"}
{"text": "How should I launch resilience analytics dashboards across mixed urban feeders?", "intent": "how_to"}
{"text": "How should I launch resilience analytics dashboards serving industrial customers?", "intent": "how_to"}
{"text": "How should I launch resilience analytics dashboards for campus-scale operations?", "intent": "how_to"}
{"text": "How should I launch resilience analytics dashboards for cold-climate solar arrays?", "intent": "how_to"}
{"text": "Outline steps to design a curtailment mitigation roadmap for coastal wind zones.", "intent": "how_to"}
{"text": "Outline steps to design a curtailment mitigation roadmap across mixed urban feeders.", "intent": "how_to"}
{"text": "Outline steps to design a curtailment mitigation roadmap serving industrial customers.", "intent": "how_to"}
{"text": "Outline steps to design a curtailment mitigation roadmap for campus-scale operations.", "intent": "how_to"}
{"text": "Outline steps to design a curtailment mitigation roadmap for cold-climate solar arrays.", "intent": "how_to"}
{"text": "Outline steps to calibrate distributed energy resource telemetry for coastal wind zones.", "intent": "how_to"}
{"text": "Outline steps to calibrate distributed energy resource telemetry across mixed urban feeders.", "intent": "how_to"}
{"text": "Outline steps to calibrate distributed energy resource telemetry serving industrial customers.", "intent": "how_to"}
{"text": "Outline steps to calibrate distributed energy resource telemetry for campus-scale operations.", "intent": "how_to"}
{"text": "Outline steps to calibrate distributed energy resource telemetry for cold-climate solar arrays.", "intent": "how_to"}
{"text": "Compare pumped hydro storage and grid-scale lithium-ion for capacity firming.", "intent": "comparison"}
{"text": "Compare pumped hydro storage and grid-scale lithium-ion in moderate climates.", "intent": "comparison"}
{"text": "Compare pumped hydro storage and grid-scale lithium-ion under regulatory scrutiny.", "intent": "comparison"}
{"text": "Compare pumped hydro storage and grid-scale lithium-ion for decarbonization roadmaps.", "intent": "comparison"}
{"text": "Compare pumped hydro storage and grid-scale lithium-ion within constrained budgets.", "intent": "comparison"}
{"text": "Compare flow batteries and green hydrogen cavern storage for capacity firming.", "intent": "comparison"}
{"text": "Compare flow batteries and green hydrogen cavern storage in moderate climates.", "intent": "comparison"}
{"text": "Compare flow batteries and green hydrogen cavern storage under regulatory scrutiny.", "intent": "comparison"}
{"text": "Compare flow batteries and green hydrogen cavern storage for decarbonization roadmaps.", "intent": "comparison"}
{"text": "Compare flow batteries and green hydrogen cavern storage within constrained budgets.", "intent": "comparison"}
{"text": "Compare dynamic line rating and topology optimization for capacity firming.", "intent": "comparison"}
{"text": "Compare dynamic line rating and topology optimization in moderate climates.", "intent": "comparison"}
{"text": "Compare dynamic line rating and topology optimization under regulatory scrutiny.", "intent": "comparison"}
{"text": "Compare dynamic line rating and topology optimization for decarbonization roadmaps.", "intent": "comparison"}
{"text": "Compare dynamic line rating and topology optimization within constrained budgets.", "intent": "comparison"}
{"text": "Compare coordinated EV charging and industrial load shedding for capacity firming.", "intent": "comparison"}
{"text": "Compare coordinated EV charging and industrial load shedding in moderate climates.", "intent": "comparison"}
{"text": "Compare coordinated EV charging and industrial load shedding under regulatory scrutiny.", "intent": "comparison"}
{"text": "Compare coordinated EV charging and industrial load shedding for decarbonization roadmaps.", "intent": "comparison"}
{"text": "Compare coordinated EV charging and industrial load shedding within constrained budgets.", "intent": "comparison"}
{"text": "Compare advanced metering infrastructure and sensor-lite telemetry for capacity firming.", "intent": "comparison"}
{"text": "Compare advanced metering infrastructure and sensor-lite telemetry in moderate climates.", "intent": "comparison"}
{"text": "Compare advanced metering infrastructure and sensor-lite telemetry under regulatory scrutiny.", "intent": "comparison"}
{"text": "Compare advanced metering infrastructure and sensor-lite telemetry for decarbonization roadmaps.", "intent": "comparison"}
{"text": "Compare advanced metering infrastructure and sensor-lite telemetry within constrained budgets.", "intent": "comparison"}
{"text": "Compare distribution static VAR compensators and synchronous condensers for capacity firming.", "intent": "comparison"}
{"text": "Compare distribution static VAR compensators and synchronous condensers in moderate climates.", "intent": "comparison"}
{"text": "Compare distribution static VAR compensators and synchronous condensers under regulatory scrutiny.", "intent": "comparison"}
{"text": "Compare distribution static VAR compensators and synchronous condensers for decarbonization roadmaps.", "intent": "comparison"}
{"text": "Compare distribution static VAR compensators and synchronous condensers within constrained budgets.", "intent": "comparison"}
{"text": "Compare microgrid islanding and grid-forming inverters for capacity firming.", "intent": "comparison"}
{"text": "Compare microgrid islanding and grid-forming inverters in moderate climates.", "intent": "comparison"}
{"text": "Compare microgrid islanding and grid-forming inverters under regulatory scrutiny.", "intent": "comparison"}
{"text": "Compare microgrid islanding and grid-forming inverters for decarbonization roadmaps.", "intent": "comparison"}
{"text": "Compare microgrid islanding and grid-forming inverters within constrained budgets.", "intent": "comparison"}
{"text": "Compare fast frequency response and synthetic inertia for capacity firming.", "intent": "comparison"}
{"text": "Compare fast frequency response and synthetic inertia in moderate climates.", "intent": "comparison"}
{"text": "Compare fast frequency response and synthetic inertia under regulatory scrutiny.", "intent": "comparison"}
{"text": "Compare fast frequency response and synthetic inertia for decarbonization roadmaps.", "intent": "comparison"}
{"text": "Compare fast frequency response and synthetic inertia within constrained budgets.", "intent": "comparison"}
{"text": "Compare demand response bidding and capacity market hedging for capacity firming.", "intent": "comparison"}
{"text": "Compare demand response bidding and capacity market hedging in moderate climates.", "intent": "comparison"}
{"text": "Compare demand response bidding and capacity market hedging under regulatory scrutiny.", "intent": "comparison"}
{"text": "Compare demand response bidding and capacity market hedging for decarbonization roadmaps.", "intent": "comparison"}
{"text": "Compare demand response bidding and capacity market hedging within constrained budgets.", "intent": "comparison"}
{"text": "Compare federated digital twins and centralized SCADA analytics for capacity firming.", "intent": "comparison"}
{"text": "Compare federated digital twins and centralized SCADA analytics in moderate climates.", "intent": "comparison"}
{"text": "Compare federated digital twins and centralized SCADA analytics under regulatory scrutiny.", "intent": "comparison"}
{"text": "Compare federated digital twins and centralized SCADA analytics for decarbonization roadmaps.", "intent": "comparison"}
{"text": "Compare federated digital twins and centralized SCADA analytics within constrained budgets.", "intent": "comparison"}
{"text": "Compare hybrid solar-plus-storage and standalone wind repowering for capacity firming.", "intent": "comparison"}
{"text": "Compare hybrid solar-plus-storage and standalone wind repowering in moderate climates.", "intent": "comparison"}
{"text": "Compare hybrid solar-plus-storage and standalone wind repowering under regulatory scrutiny.", "intent": "comparison"}
{"text": "Compare hybrid solar-plus-storage and standalone wind repowering for decarbonization roadmaps.", "intent": "comparison"}
{"text": "Compare hybrid solar-plus-storage and standalone wind repowering within constrained budgets.", "intent": "comparison"}
{"text": "Compare peer-to-peer energy trading and community choice aggregation for capacity firming.", "intent": "comparison"}
{"text": "Compare peer-to-peer energy trading and community choice aggregation in moderate climates.", "intent": "comparison"}
{"text": "Compare peer-to-peer energy trading and community choice aggregation under regulatory scrutiny.", "intent": "comparison"}
{"text": "Compare peer-to-peer energy trading and community choice aggregation for decarbonization roadmaps.", "intent": "comparison"}
{"text": "Compare peer-to-peer energy trading and community choice aggregation within constrained budgets.", "intent": "comparison"}
{"text": "Explore grid-forming inverter pilots and highlight quick-win analyses.", "intent": "exploration"}
{"text": "Explore grid-forming inverter pilots and map stakeholder concerns.", "intent": "exploration"}
{"text": "Explore grid-forming inverter pilots and estimate budget scenarios.", "intent": "exploration"}
{"text": "Explore grid-forming inverter pilots and identify necessary data streams.", "intent": "exploration"}
{"text": "Explore grid-forming inverter pilots and outline regulatory milestones.", "intent": "exploration"}
{"text": "Explore resilience investment pathways and highlight quick-win analyses.", "intent": "exploration"}
{"text": "Explore resilience investment pathways and map stakeholder concerns.", "intent": "exploration"}
{"text": "Explore resilience investment pathways and estimate budget scenarios.", "intent": "exploration"}
{"text": "Explore resilience investment pathways and identify necessary data streams.", "intent": "exploration"}
{"text": "Explore resilience investment pathways and outline regulatory milestones.", "intent": "exploration"}
{"text": "Explore regional flexibility marketplaces and highlight quick-win analyses.", "intent": "exploration"}
{"text": "Explore regional flexibility marketplaces and map stakeholder concerns.", "intent": "exploration"}
{"text": "Explore regional flexibility marketplaces and estimate budget scenarios.", "intent": "exploration"}
{"text": "Explore regional flexibility marketplaces and identify necessary data streams.", "intent": "exploration"}
{"text": "Explore regional flexibility marketplaces and outline regulatory milestones.", "intent": "exploration"}
{"text": "Explore distributed energy resource staffing and highlight quick-win analyses.", "intent": "exploration"}
{"text": "Explore distributed energy resource staffing and map stakeholder concerns.", "intent": "exploration"}
{"text": "Explore distributed energy resource staffing and estimate budget scenarios.", "intent": "exploration"}
{"text": "Explore distributed energy resource staffing and identify necessary data streams.", "intent": "exploration"}
{"text": "Explore distributed energy resource staffing and outline regulatory milestones.", "intent": "exploration"}
{"text": "Explore hydrogen production siting and highlight quick-win analyses.", "intent": "exploration"}
{"text": "Explore hydrogen production siting and map stakeholder concerns.", "intent": "exploration"}
{"text": "Explore hydrogen production siting and estimate budget scenarios.", "intent": "exploration"}
{"text": "Explore hydrogen production siting and identify necessary data streams.", "intent": "exploration"}
{"text": "Explore hydrogen production siting and outline regulatory milestones.", "intent": "exploration"}
{"text": "Explore long-duration storage procurement and highlight quick-win analyses.", "intent": "exploration"}
{"text": "Explore long-duration storage procurement and map stakeholder concerns.", "intent": "exploration"}
{"text": "Explore long-duration storage procurement and estimate budget scenarios.", "intent": "exploration"}
{"text": "Explore long-duration storage procurement and identify necessary data streams.", "intent": "exploration"}
{"text": "Explore long-duration storage procurement and outline regulatory milestones.", "intent": "exploration"}
{"text": "Explore EV fleet managed charging and highlight quick-win analyses.", "intent": "exploration"}
{"text": "Explore EV fleet managed charging and map stakeholder concerns.", "intent": "exploration"}
{"text": "Explore EV fleet managed charging and estimate budget scenarios.", "intent": "exploration"}
{"text": "Explore EV fleet managed charging and identify necessary data streams.", "intent": "exploration"}
{"text": "Explore EV fleet managed charging and outline regulatory milestones.", "intent": "exploration"}
{"text": "Explore digital twin operations centers and highlight quick-win analyses.", "intent": "exploration"}
{"text": "Explore digital twin operations centers and map stakeholder concerns.", "intent": "exploration"}
{"text": "Explore digital twin operations centers and estimate budget scenarios.", "intent": "exploration"}
{"text": "Explore digital twin operations centers and identify necessary data streams.", "intent": "exploration"}
{"text": "Explore digital twin operations centers and outline regulatory milestones.", "intent": "exploration"}
{"text": "Explore climate risk scoring rollouts and highlight quick-win analyses.", "intent": "exploration"}
{"text": "Explore climate risk scoring rollouts and map stakeholder concerns.", "intent": "exploration"}
{"text": "Explore climate risk scoring rollouts and estimate budget scenarios.", "intent": "exploration"}
{"text": "Explore climate risk scoring rollouts and identify necessary data streams.", "intent": "exploration"}
{"text": "Explore climate risk scoring rollouts and outline regulatory milestones.", "intent": "exploration"}
{"text": "Explore community energy equity planning and highlight quick-win analyses.", "intent": "exploration"}
{"text": "Explore community energy equity planning and map stakeholder concerns.", "intent": "exploration"}
{"text": "Explore community energy equity planning and estimate budget scenarios.", "intent": "exploration"}
{"text": "Explore community energy equity planning and identify necessary data streams.", "intent": "exploration"}
{"text": "Explore community energy equity planning and outline regulatory milestones.", "intent": "exploration"}
{"text": "Provide exploration prompts for grid-forming inverter pilots that highlight quick-win analyses.", "intent": "exploration"}
{"text": "Provide exploration prompts for grid-forming inverter pilots that map stakeholder concerns.", "intent": "exploration"}
{"text": "Provide exploration prompts for grid-forming inverter pilots that estimate budget scenarios.", "intent": "exploration"}
{"text": "Provide exploration prompts for grid-forming inverter pilots that identify necessary data streams.", "intent": "exploration"}
{"text": "Provide exploration prompts for grid-forming inverter pilots that outline regulatory milestones.", "intent": "exploration"}
{"text": "Provide exploration prompts for resilience investment pathways that highlight quick-win analyses.", "intent": "exploration"}
{"text": "Provide exploration prompts for resilience investment pathways that map stakeholder concerns.", "intent": "exploration"}
{"text": "Provide exploration prompts for resilience investment pathways that estimate budget scenarios.", "intent": "exploration"}
{"text": "Provide exploration prompts for resilience investment pathways that identify necessary data streams.", "intent": "exploration"}
{"text": "Provide exploration prompts for resilience investment pathways that outline regulatory milestones.", "intent": "exploration"}
{"text": "Clarify when to use breadth-first search for graph traversal problems.", "intent": "definition"}
{"text": "Clarify when to use breadth-first search in graph analytics.", "intent": "definition"}
{"text": "Clarify when to use breadth-first search.", "intent": "definition"}
{"text": "Define breadth-first search in graph theory.", "intent": "definition"}
{"text": "Define photosynthesis in simple terms for students.", "intent": "definition"}
{"text": "Explain the concept of opportunity cost in economics.", "intent": "definition"}
{"text": "Clarify the definition of cultural relativism.", "intent": "definition"}
{"text": "Explain what blockchain technology means in finance.", "intent": "definition"}
{"text": "Define biodiversity for environmental science discussions.", "intent": "definition"}
{"text": "Define homeostasis for medical trainees.", "intent": "definition"}
{"text": "Explain the golden ratio in mathematics lessons.", "intent": "definition"}
{"text": "Define mindfulness within personal development coaching.", "intent": "definition"}
{"text": "Clarify what is meant by data governance in organizations.", "intent": "definition"}
{"text": "Explain what quantum entanglement describes in physics.", "intent": "definition"}
{"text": "Define stellar nucleosynthesis for astronomy outreach.", "intent": "definition"}
{"text": "Clarify the meaning of plate tectonics for geography students.", "intent": "definition"}
{"text": "How should I start researching renewable energy?", "intent": "how_to"}
{"text": "List first steps for researching renewable energy.", "intent": "how_to"}
{"text": "How do I design a study timetable for finals?", "intent": "how_to"}
{"text": "How to brew pour-over coffee at home?", "intent": "how_to"}
{"text": "How do I create a personal budget from scratch?", "intent": "how_to"}
{"text": "How to configure a secure home Wi-Fi network?", "intent": "how_to"}
{"text": "How do I analyze a poem for symbolism?", "intent": "how_to"}
{"text": "How to organize a community beach cleanup?", "intent": "how_to"}
{"text": "How do I set measurable fitness goals?", "intent": "how_to"}
{"text": "What is the best way to mentor a new team member?", "intent": "how_to"}
{"text": "How should I prepare a pitch deck for investors?", "intent": "how_to"}
{"text": "How do I troubleshoot a failing hard drive?", "intent": "how_to"}
{"text": "How do I practice mindful breathing each morning?", "intent": "how_to"}
{"text": "How to plan a sustainable garden layout?", "intent": "how_to"}
{"text": "What is the best way to practice interview responses?", "intent": "how_to"}
{"text": "Outline steps to conduct a literature review.", "intent": "how_to"}
{"text": "Compare supervised and unsupervised learning.", "intent": "comparison"}
{"text": "Contrast supervised and unsupervised learning.", "intent": "comparison"}
{"text": "Compare renewable and fossil fuel energy sources.", "intent": "comparison"}
{"text": "Contrast machine learning and statistics approaches.", "intent": "comparison"}
{"text": "Compare centralized and decentralized grid control.", "intent": "comparison"}
{"text": "Compare AC and DC microgrids for campus deployment.", "intent": "comparison"}
{"text": "Contrast battery storage and pumped hydro for peak shaving.", "intent": "comparison"}
{"text": "Compare rooftop solar and community solar adoption strategies.", "intent": "comparison"}
{"text": "Contrast agile and waterfall project management styles.", "intent": "comparison"}
{"text": "Compare qualitative and quantitative research methods.", "intent": "comparison"}
{"text": "Contrast heat pumps with gas furnaces for decarbonization.", "intent": "comparison"}
{"text": "Compare mentoring and coaching approaches for teams.", "intent": "comparison"}
{"text": "Contrast VR and AR learning experiences.", "intent": "comparison"}
{"text": "Compare deterministic and stochastic optimization techniques.", "intent": "comparison"}
{"text": "Contrast direct load control and price-based demand response.", "intent": "comparison"}
{"text": "Compare descriptive and inferential statistics for surveys.", "intent": "comparison"}
{"text": "Offer reflective prompts for creative writing.", "intent": "exploration"}
{"text": "Offer reflective prompts for creative writing sessions.", "intent": "exploration"}
{"text": "Provide reflective prompts about community building.", "intent": "exploration"}
{"text": "Share exploration prompts for journaling about gratitude.", "intent": "exploration"}
{"text": "Suggest exploration questions about mindful leadership.", "intent": "exploration"}
{"text": "Brainstorm exploration themes for innovation workshops.", "intent": "exploration"}
{"text": "Generate exploration prompts for climate activism clubs.", "intent": "exploration"}
{"text": "Curate exploration prompts for team retrospectives.", "intent": "exploration"}
{"text": "Propose exploration prompts for student career planning.", "intent": "exploration"}
{"text": "Share exploration prompts about remote collaboration habits.", "intent": "exploration"}
{"text": "Offer exploration prompts for civic engagement meetups.", "intent": "exploration"}
{"text": "Suggest exploration prompts for sustainable design studios.", "intent": "exploration"}
{"text": "Provide exploration prompts for resilience coaching.", "intent": "exploration"}
{"text": "List exploration prompts for intercultural dialogue circles.", "intent": "exploration"}
{"text": "Craft exploration prompts for creative writing clubs.", "intent": "exploration"}
{"text": "Share exploration prompts for mindful productivity journals.", "intent": "exploration"}
{"text": "Clarify when to use breadth-first search", "intent": "definition"}
{"text": "Offer reflective prompts for creative writing", "intent": "exploration"}
{"text": "Compare supervised and unsupervised learning", "intent": "comparison"}
{"text": "What is the best way to practice interview responses", "intent": "how_to"}
{"text": "What is the best way to mentor a new team member?", "intent": "how_to"}
{"text": "What is the best way to plan a sustainable garden layout?", "intent": "how_to"}
{"text": "Outline the best way to practice interview responses before a job fair.", "intent": "how_to"}
{"text": "Explain the best way to practice interview responses with a friend.", "intent": "how_to"}
